"""
python 之禅，Tim Peters 著

优美胜于丑陋（Python 以编写优美的代码为目标）
明了胜于晦涩（优美的代码应当是明了的，命名规范，风格相似）
简洁胜于复杂（优美的代码应当是简洁的，不要有复杂的内部实现）
复杂胜于凌乱（如果复杂不可避免，那代码间也不能有难懂的关系，要保持简洁）
扁平胜于嵌套（优美的代码应当是扁平的，不能有太多的嵌套）
间隔胜于紧凑（优美的代码有适当的间隔，不要奢望一行代码解决问题）
可读性很重要（优美的代码是可读的）
即便特例，也不能违背这些规则（这些规则适用于绝大多数代码）
不过，对于特殊情况，也不是绝对的（特殊情况也许需要特殊处理）
错误不应悄悄忽略，除非你确认需要这样做（不要放过任何一个错误，除非有明确需要）
面对不确定性，拒绝猜测的诱惑（遇到问题不能凭感觉猜测，应有明确的解决方案）
应该有一种，最好只有一种显而易见的解决方案（优美的代码有唯一的、明显的解决方案）
尽管这种方案一开始并不是显而易见的，除非你是荷兰人（这句暗指 Python 语言创始人 Guido 是荷兰人）
现在比没有好，虽然没有比**恰好**好更好（用代码解决问题的速度不能影响代码的质量）
如果一个实现方案难于理解，那它就不好（不好的代码是解释起来难以理解的）
如果一个实现方案易于理解，那它就是好的（优秀的代码是容易理解的）
命名空间是一个很棒的理念，我们应当多加利用（Python 允许用不同的方式组织数据）

"""